Repository: DevCraftClub/mhadmin
Catalog: upload/engine/inc/maharder/_locales/*/mhadmin.xliff
Languages: de_de, uk_ua

source: Документация
de_de: Überbringer
uk_ua: Документація

source: Пользовательское соглашение
de_de: Prozess-Timeout
uk_ua: Угода користувача

source: Перевод
de_de: Frage
uk_ua: Переклад

source: Об авторе
de_de: Verwerfen-Ändern
uk_ua: Про автора

source: Финансовая поддержка (добровольная)
de_de: cache-vcs-dir
uk_ua: Фінансова підтримка (добровільна)

source: Текущее значение
de_de: github-protocols
uk_ua: Поточне значення

source: Данные были сохранены!
de_de: cache-files-ttl

source: Поисковая фраза
de_de: cache-files-maxsize
uk_ua: Пошукова фраза

source: Искать
de_de: Zuhause
uk_ua: Шукати

source: Поиск
de_de: use-parent-dir
uk_ua: Пошук

source: Закрыть меню
de_de: allow_url_fopen
uk_ua: Закрити меню

source: Проверить на наличие новой версии
de_de: gitlab-Domänen
uk_ua: Перевірити на наявність нової версії

source: Подождите, идёт загрузка...
de_de: standard_ocket_timeout
uk_ua: Зачекайте, йде завантаження...

source: Открыть меню
de_de: github-Domains
uk_ua: Відкрити меню

source: Ошибка при обработке данных!
de_de: Shop-Autoren
uk_ua: Помилка при обробці даних!

source: Успех!
de_de: github-expose-hostname
uk_ua: Успіх!

source: Уведомление
de_de: xdebug.scream
uk_ua: Повідомлення

source: Дата и время
de_de: disable-tls
uk_ua: Дата та час

source: Описание
de_de: Beschreibung
uk_ua: Опис

source: Все типы ошибок
de_de: cache-dir
uk_ua: Всі типи помилок

source: Уведомление / К справке
de_de: Daten-Verzeichnis
uk_ua: Повідомлення / До довідки

source: Предупреждение
de_de: cache-files-dir
uk_ua: Попередження

source: Критическая ошибка
de_de: cache-read-only
uk_ua: Критична помилка

source: Требует срочного решения
de_de: prefer-install
uk_ua: Потребує термінового вирішення

source: E-Mail
de_de: bin-dir

source: Telegram
de_de: bin-compat

source: Вебсайт
de_de: cafile

source: Русский
de_de: capath
uk_ua: Російська

source: Английский
de_de: optimise-autoloader
uk_ua: Англійська

source: Немецкий
de_de: classmap-authoritative
uk_ua: Німецька

source: Украинский
de_de: apcu-autoloader
uk_ua: Українська

source: Нужные данные не были заполнены
de_de: cache-repo-dir
uk_ua: Необхідні дані не були заповнені

source: Ошибка во время создания папки
de_de: cache-ttl
uk_ua: Помилка під час створення папки

source: Такая папка уже существует
de_de: Pakete
uk_ua: Така папка вже існує

source: Данный файл уже существует.
de_de: sort-packages
uk_ua: Цей файл вже існує.

source: Плагин уже существует
de_de: allow-plugins
uk_ua: Плагін вже існує

source: Путь "%s" не был создан
de_de: Der Pfad "%s" wurde nicht erstellt
uk_ua: Шлях "%s" не було створено

source: Файл '{file}' не был сохранён!
de_de: Die Datei '{file}' wurde nicht gespeichert!
uk_ua: Файл '{file}' не був збережений!

source: ID ресурса не было указано
de_de: Die Ressourcen-ID wurde nicht angegeben
uk_ua: ID ресурсу не було вказано

source: [NEW] Добавлено моделирование таблиц в базе данных при помощи <a href="https://cycle-orm.dev" target="_blank">Cycle ORM</a>. Это поможет в дальнейшем создавать модули с более сложной структурой и работу с данными.
de_de: [NEU] Die Modellierung von Datenbanktabellen wurde mit Hilfe von <a href="https://cycle-orm.dev" target="_blank">Cycle ORM</a> hinzugefügt. Dies wird zukünftig die Erstellung von Modulen mit einer komplexeren Struktur und die Arbeit mit Daten erleichtern.
uk_ua: [NEW] Додано моделювання таблиць у базі даних за допомогою <a href="https://cycle-orm.dev" target="_blank">Cycle ORM</a>. Це допоможе в подальшому створювати модулі з більш складною структурою та працювати з даними.

source: [NEW] Все изменения в таблицах будут храниться в отдельной таблице "migrations" и в папке "_migrations". Это позволит легко сделать откат изменений.
de_de: [NEU] Alle Änderungen an den Tabellen werden in einer separaten Tabelle "migrations" und im Ordner "_migrations" gespeichert. Dies ermöglicht eine einfache Rückgängigmachung von Änderungen.
uk_ua: [NEW] Усі зміни в таблицях зберігатимуться в окремій таблиці "migrations" та у папці "_migrations". Це дозволить легко відкотити зміни.

source: [NEW] Добавлена возможность сортировать и фильтровать данные таблиц на страницах административной панели (где такие есть, пример: Логи).
de_de: [NEU] Die Möglichkeit, Tabellendaten auf den Seiten des Administrationspanels zu sortieren und zu filtern, wurde hinzugefügt (wo vorhanden, Beispiel: Protokolle).
uk_ua: [NEW] Додано можливість сортувати та фільтрувати дані таблиць на сторінках адміністративної панелі (де доступно, наприклад: Логи).

source: [NEW] Добавлена возможность проверять на обновление плагина на сайте <a href="https://devcraft.club" target="_blank">devcraft.club</a>. Используется гостевой ключ.
de_de: [NEU] Die Möglichkeit, Plugin-Updates auf der Website <a href="https://devcraft.club" target="_blank">devcraft.club</a> zu überprüfen, wurde hinzugefügt. Es wird ein Gastschlüssel verwendet.
uk_ua: [NEW] Додано можливість перевіряти оновлення плагіна на сайті <a href="https://devcraft.club" target="_blank">devcraft.club</a>. Використовується гостьовий ключ.

source: [UPDATE][BETA] Установщик упрощён. Теперь зависимости загружаются и устанавливаются при первом открытии [любого] модуля. Может занять несколько минут. Теперь установщик весит мало.
de_de: [UPDATE][BETA] Der Installer wurde vereinfacht. Abhängigkeiten werden jetzt beim ersten Öffnen eines [beliebigen] Moduls geladen und installiert. Es kann einige Minuten dauern. Der Installer ist jetzt sehr leicht.
uk_ua: [UPDATE][BETA] Встановник спрощений. Тепер залежності завантажуються та встановлюються при першому відкритті [будь-якого] модуля. Може зайняти кілька хвилин. Тепер встановник важить мало.

source: [UPDATE] Изменена структура файлов админпанели. Теперь все файлы модуля находятся в папке "_modules", a шаблоны в папке "_templates".
de_de: [UPDATE] Die Struktur der Admin-Panel-Dateien wurde geändert. Jetzt befinden sich alle Moduldateien im Ordner "_modules" und die Vorlagen im Ordner "_templates".
uk_ua: [UPDATE] Змінена структура файлів адміністративної панелі. Тепер всі файли модуля знаходяться в папці "_modules", а шаблони в папці "_templates".

source: [DELETE] Удалены устаревшие и ненужные методы логирования.
de_de: [DELETE] Veraltete und unnötige Protokollierungsmethoden wurden entfernt.
uk_ua: [DELETE] Видалено застарілі та непотрібні методи логування.

source: [DELETE] Удалена замена иконок в админпанели DLE.
de_de: [DELETE] Das Ersetzen von Symbolen im DLE-Admin-Panel wurde entfernt.
uk_ua: [DELETE] Видалено заміну іконок у адміністративній панелі DLE.

source: Журнал изменений
de_de: Änderungsprotokoll
uk_ua: Журнал змін

source: Название модуля
de_de: Modulname
uk_ua: Назва модуля

source: Введите название модуля, скрипт создаст сам все пути и файлы и настроит к ним нужные права доступа.
de_de: Geben Sie den Modulnamen ein; das Skript erstellt automatisch alle Pfade und Dateien und richtet die erforderlichen Zugriffsrechte ein.
uk_ua: Введіть назву модуля, скрипт сам створить усі шляхи та файли і налаштує до них необхідні права доступу.

source: Название модуля на латинице
de_de: Modulname in Lateinischen Buchstaben
uk_ua: Назва модуля латиницею

source: Введите название модуля на латинице, иначе будет использована стандартная функция DLE для преобразования названия.
de_de: Geben Sie den Modulnamen in lateinischen Buchstaben ein, andernfalls wird die Standardfunktion von DLE zur Umwandlung des Namens verwendet.
uk_ua: Введіть назву модуля латиницею, інакше буде використана стандартна функція DLE для перетворення назви.

source: Описание модуля
de_de: Modulbeschreibung
uk_ua: Опис модуля

source: Введите описание модуля
de_de: Geben Sie die Modulbeschreibung ein
uk_ua: Введіть опис модуля

source: Версия модуля
de_de: Modulversion
uk_ua: Версія модуля

source: Введите версию модуля
de_de: Geben Sie die Modulversion ein
uk_ua: Введіть версію модуля

source: Иконка
de_de: Symbol
uk_ua: Іконка

source: Класс иконки. К сайту подключены FontAwesome PRO.<br>По умолчанию: <i class="fad fa-cogs"></i> (fad fa-cogs)
de_de: Iconklasse. FontAwesome PRO ist mit der Website verbunden.<br>Standard: <i class="fad fa-cogs"></i> (fad fa-cogs)
uk_ua: Клас іконки. До сайту підключено FontAwesome PRO.<br>За замовчуванням: <i class="fad fa-cogs"></i> (fad fa-cogs)

source: Иконка плагина
de_de: Plugin-Symbol
uk_ua: Іконка плагіна

source: Укажите полный путь к иконке плагина начиная от корня вашего сайта. Например engine/skins/images/my_icon.png
de_de: Geben Sie den vollständigen Pfad zum Plugin-Symbol ab dem Stammverzeichnis Ihrer Website an. Zum Beispiel engine/skins/images/my_icon.png
uk_ua: Вкажіть повний шлях до іконки плагіна, починаючи від кореня вашого сайту. Наприклад, engine/skins/images/my_icon.png

source: Название проекта на CrowdIn
de_de: Projektname auf CrowdIn
uk_ua: Назва проекту на CrowdIn

source: Укажите URL наимование Вашего проекта на CrowdIn. Пример: Из https://crowdin.com/project/<b>mhadmin</b>/ берём mhadmin.<br><br><i>По умолчанию: Название на латинице</i>
de_de: Geben Sie den URL-Namen Ihres Projekts auf CrowdIn an. Beispiel: Von https://crowdin.com/project/<b>mhadmin</b>/ nehmen wir mhadmin.<br><br><i>Standard: Name in lateinischen Buchstaben</i>
uk_ua: Вкажіть назву URL вашого проекту на CrowdIn. Приклад: З https://crowdin.com/project/<b>mhadmin</b>/ беремо mhadmin.<br><br><i>За замовчуванням: Назва латиницею</i>

source: ID статистики перевода на CrowdIn
de_de: Übersetzungsstatistik-ID auf CrowdIn
uk_ua: ID статистики перекладів на CrowdIn

source: Укажите ID статистики перевода на CrowdIn из дополнения <a href="https://crowdin.com/store/apps/bds" target="_blank">Badges & Status Images</a>
de_de: Geben Sie die Übersetzungsstatistik-ID auf CrowdIn aus dem <a href="https://crowdin.com/store/apps/bds" target="_blank">Badges & Status Images</a> Add-On an;
uk_ua: Вкажіть ID статистики перекладів на CrowdIn з доповнення <a href="https://crowdin.com/store/apps/bds" target="_blank">Badges & Status Images</a>

source: Ссылка на модуль автора
de_de: Link zum Autorenmodul
uk_ua: Посилання на модуль автора

source: Введите ссылку модуля на сайте автора (тех. поддержка, гитхаб, ..)
de_de: Geben Sie den Link zum Modul auf der Autoren-Website ein (technischer Support, GitHub, ...)
uk_ua: Введіть посилання на модуль на сайті автора (технічна підтримка, GitHub тощо)

source: Ссылка на документацию модуля
de_de: Link zur Moduldokumentation
uk_ua: Посилання на документацію модуля

source: Введите ссылку документации модуля на сайте автора (тех. поддержка, гитхаб, ..)
de_de: Geben Sie den Link zur Moduldokumentation auf der Autoren-Website ein (technischer Support, GitHub, ...)
uk_ua: Введіть посилання на документацію модуля на сайті автора (технічна підтримка, GitHub тощо)

source: Добавить в плагины?
de_de: Zu Plugins hinzufügen?
uk_ua: Додати до плагінів?

source: Скрипт создаст начальный плагин и добавит его в базу данных
de_de: Das Skript erstellt ein Anfangs-Plugin und fügt es der Datenbank hinzu
uk_ua: Скрипт створить початковий плагін і додасть його до бази даних

source: Перезаписать файлы?
de_de: Dateien überschreiben?
uk_ua: Перезаписати файли?

source: Скрипт перезапишет существующие файлы шаблонами.<br><span class="ui red text">На свой страх и риск!</span>
de_de: Das Skript wird vorhandene Dateien mit Vorlagen überschreiben.<br><span class="ui red text">Auf eigene Gefahr!</span>
uk_ua: Скрипт перезапише існуючі файли шаблонами.<br><span class="ui red text">На свій страх і ризик!</span>

source: Создать
de_de: erstellen

source: Файл :file: создан
de_de: Datei :file: erstellt
uk_ua: Файл :file: створено

source: Плагин "<b>:name:</b>" был создан
de_de: Das Plugin "<b>:name:</b>" wurde erstellt
uk_ua: Плагін "<b>:name:</b>" було створено

source: Плагин не был создан!
de_de: Das Plugin wurde nicht erstellt!
uk_ua: Плагін не був створений!

source: Модуль был создан!
de_de: Das Modul wurde erstellt!
uk_ua: Модуль створено!

source: Произошла ошибка!
de_de: Ein Fehler ist aufgetreten!
uk_ua: Сталася помилка!

source: Загружаем файл: <b>:file:</b>!<br>Результат находится в консоли браузера!
de_de: Datei wird geladen: <b>:file:</b>!<br>Das Ergebnis befindet sich in der Browserkonsole!
uk_ua: Завантажуємо файл: <b>:file:</b>!<br>Результат знаходиться в консолі браузера!

source: Обновлениям быть!
de_de: Es gibt Updates!
uk_ua: Оновлень немає!

source: Создание модуля
de_de: Module Creation
uk_ua: Створення модуля

source: [FIX] Исправлена работа с composer
de_de: [FIX] Die Arbeit mit Composer wurde korrigiert
uk_ua: [FIX] Виправлена робота з composer

source: [FIX] Исправлена проблема цикличности в классе переводов
de_de: [FIX] Zyklizitätsproblem in der Übersetzungsklasse behoben
uk_ua: [FIX] Виправлено циклічну залежність у класі перекладів

source: [FIX] По неопределённой причине закинул старую версию поверх новой при мёрдже
de_de: [FIX] Aus unbekanntem Grund wurde die alte Version beim Merge über die neue gelegt
uk_ua: [FIX] З невідомих причин стара версія була злита поверх нової при злитті

source: [FIX] Исправлена загрузка скриптов при помощи composer
de_de: [FIX] Das Laden von Skripten mit Composer behoben
uk_ua: [FIX] Виправлено завантаження скриптів за допомогою composer

source: [FIX] Исправлены мелкие ошибки в коде
de_de: [FIX] Kleinere Fehler im Code behoben
uk_ua: [FIX] Виправлено невеликі помилки в коді

source: [FIX] Добавлены placeholder для стилей и скриптов
de_de: [FIX] Platzhalter für Styles und Skripte hinzugefügt
uk_ua: [FIX] Додано заповнювачі для стилів і скриптів

source: Не удалось сохранить файл блокировки обновлений: {{path}}
de_de: Speichern der Update-Sperrdatei fehlgeschlagen: {{path}}
uk_ua: Не вдалося зберегти файл блокування оновлень: {{path}}

source: Не удалось выставить права на запись файла блокировки обновлений: {{path}}
de_de: Setzen der Schreibberechtigungen für die Update-Sperrdatei fehlgeschlagen: {{path}}
uk_ua: Не вдалося встановити права на запис файлу блокування оновлень: {{path}}

source: Не удалось обновить содержимое файла блокировки обновлений: {{path}}
de_de: Aktualisieren des Inhalts der Update-Sperrdatei fehlgeschlagen: {{path}}
uk_ua: Не вдалося оновити вміст файлу блокування оновлень: {{path}}

source: Плагин "{plugin}" был создан!
de_de: Das Plugin "{plugin}" wurde erstellt!
uk_ua: Плагін "{plugin}" було створено!

source: Путь "{path}" не был создан.
de_de: Der Pfad "{path}" wurde nicht erstellt.
uk_ua: Шлях "{path}" не було створено.

source: Страница %page%
de_de: Seite %page%
uk_ua: Сторінка %page%
