Repository: DevCraftClub/mhadmin
Catalog: upload/engine/inc/maharder/_locales/*/mhadmin.xliff
Languages: de_de, uk_ua

source: Административная панель для моих разработок
de_de: Verwaltungspanel für meine Entwicklungen
uk_ua: Адміністративна панель для моїх розробок

source: Генератор модулей
de_de: Modul-Generator
uk_ua: Генератор модулів

source: Вывод логов
de_de: Log-Ausgabe
uk_ua: Вивід логів

source: Тип
de_de: Typ

source: Плагин
de_de: Plug-in
uk_ua: Плагін

source: Функция
de_de: Funktion
uk_ua: Функція

source: Время
de_de: Zeit
uk_ua: Час

source: Сообщение
de_de: Nachricht
uk_ua: Повідомлення

source: Действие
de_de: Aktion
uk_ua: Дія

source: Удалить
de_de: Löschen

source: Всё отлично!
de_de: Sieht gut aus!
uk_ua: Все чудово!

source: <p>Запись была удалена!</p>
de_de: <><>p Dieser Eintrag wurde gelöscht! /p
uk_ua: <p>Запис був видалений!</p>

source: Ошибка
de_de: Fehler
uk_ua: Помилка

source: Настройки
de_de: Einstellungen

source: Количество объектов
de_de: Anzahl der Objekte
uk_ua: Кількість об'єктів

source: Путь до кеша файлов
de_de: Datei-Cache-Pfad
uk_ua: Шлях до кешу файлів

source: Время хранения кеша
de_de: Cache-Speicherzeit
uk_ua: Час зберігання кешу

source: Введите время в минутах, сколько кеш запросов должен быть сохранён на сервере. При запросе скрипт будет проверять когда был создан файл кеша и если он будет превышать заданный лимит, то кеш будет пересоздан.<br><b><i>По умолчанию: 60 минут</i></b>
de_de: Geben Sie die Zeit in Minuten an, wie viel vom Anfrage-Cache auf dem Server gespeichert werden soll. Wenn eine Anfrage gestellt wird, prüft das Skript, wann die Cachedatei erstellt wurde, und wenn sie das angegebene Limit überschreitet, wird der Cache neu erstellt.<br><b><i>Standardwert: 60 Minuten</i></b>
uk_ua: Введіть час у хвилинах, на скільки кеш-запитів має бути збережено на сервері. При запиті скрипт буде перевіряти, коли був створений кеш-файл, і якщо він перевищує заданий ліміт, кеш буде пересозданий.<br><b><i>За замовчуванням: 60 хвилин</i></b>

source: Язык админки
de_de: Admin-Sprache
uk_ua: Мова адмінки

source: Путь до файлов языков
de_de: Pfad zu den Sprachdateien
uk_ua: Шлях до файлів мов

source: Включить логирование?
de_de: Protokollierung einschalten?
uk_ua: Увімкнути логування?

source: При включенном параметре будет создавать текстовые логи в папке <b>engine/inc/maharder/_logs</b>
de_de: Wenn aktiviert, werden Textprotokolle im Ordner <b>engine/inc/maharder/_logs</b> erstellt.
uk_ua: При увімкненні параметра буде створюватися текстові логи в папці <b>engine/inc/maharder/_logs</b>

source: Сохранять логи в базе данных?
de_de: Protokolle in der Datenbank speichern?
uk_ua: Зберігати логи в базі даних?

source: Отправлять логи в телеграм?
de_de: Protokolle an Telegram senden?
uk_ua: Надсилати логи в телеграм?

source: API ключ бота
de_de: API-Bot-Schlüssel

source: Канал телеграма
de_de: Telegram-Kanal
uk_ua: Канал телеграму

source: Тип оповещений
de_de: Benachrichtigungstyp
uk_ua: Тип сповіщень

source: <div class="item"><b>Все</b> - Отправляет буквально все отчёты и логи в канал</div>
de_de: <div class="item"><b>Alle</b> - Sendet buchstäblich alle Berichte und Protokolle an den Kanal</div>
uk_ua: <div class="item"><b>Все</b> - Відправляє буквально всі звіти та логи в канал</div>

source: <div class="item"><b>Ошибки</b> - Отправляет только ошибки в канал</div>
de_de: <div class="item"><b>Fehler</b> - Sendet nur Fehler an den Kanal</div>
uk_ua: <div class="item"><b>Помилки</b> - Відправляє тільки помилки в канал</div>

source: <div class="item"><b>Информация</b> - Отправляет только информационные отчёты в канал</div>
de_de: <div class="item"><b>Informationen</b> - Sendet nur Informationsberichte an den Kanal</div>
uk_ua: <div class="item"><b>Інформація</b> - Відправляє тільки інформаційні звіти в канал</div>

source: <div class="item"><b>Уведомления</b> - Отправляет только уведомления в канал</div>
de_de: <div class="item"><b>Benachrichtigungen</b> - Sendet nur Benachrichtigungen an den Kanal</div>
uk_ua: <div class="item"><b>Сповіщення</b> - Відправляє тільки сповіщення в канал</div>

source: <div class="item"><b>Предупреждения</b> - Отправляет только предупреждения в канал</div>
de_de: <div class="item"><b>Warnungen</b> - Sendet nur Warnungen an den Kanal</div>
uk_ua: <div class="item"><b>Попередження</b> - Відправляє тільки попередження в канал</div>

source: <div class="item"><b>Критические ошибки</b> - Отправляет только критические ошибки в канал</div>
de_de: <div class="item"><b>Kritische Fehler</b> - Sendet nur kritische Fehler an den Kanal</div>
uk_ua: <div class="item"><b>Критичні помилки</b> - Відправляє тільки критичні помилки в канал</div>

source: <div class="item"><b>Отладка</b> - Отправляет только информацию об отладке в канал</div>
de_de: <div class="item"><b>Fehlersuche</b> - Sendet nur Fehlersuchinformationen an den Kanal</div>
uk_ua: <div class="item"><b>Налагодження</b> - Відправляє тільки інформацію про налагодження в канал</div>

source: Если в плагине логирование не проставлено, то и сообщения этого рода тоже не будут отправлены.<br>Если выбрано "Все", то остальные выбранные параметры игнорируются
de_de: Wenn die Protokollierung im Plugin nicht eingestellt ist, werden Nachrichten dieser Art auch nicht gesendet.<br>Wenn "Alle" ausgewählt ist, werden die anderen ausgewählten Optionen ignoriert.
uk_ua: Якщо в плагіні логування не встановлено, то і повідомлення цього роду також не будуть відправлені.<br>Якщо вибрано "Все", то інші обрані параметри ігноруються

source: Все
de_de: Alles

source: Ошибки
de_de: Fehler
uk_ua: Помилки

source: Информация
de_de: Informationen
uk_ua: Інформація

source: Уведомления
de_de: Benachrichtigungen
uk_ua: Повідомлення

source: Предупреждения
de_de: Warnungen
uk_ua: Попередження

source: Критические ошибки
de_de: Kritische Fehler
uk_ua: Критичні помилки

source: Отладка
de_de: Debug
uk_ua: Налагодження

source: Заменять иконки?
de_de: Icons ersetzen?
uk_ua: Замінювати іконки?

source: При включении, в админпанеле DLE будут заменены старые иконки на обновлённые
de_de: Wenn diese Option aktiviert ist, werden die alten Symbole durch aktualisierte Symbole im DLE-Verwaltungsbereich ersetzt.
uk_ua: Під час увімкнення, в адмінпанелі DLE будуть замінені старі іконки на оновлені

source: Добавить кнопку с очищением кеша?
de_de: Eine Schaltfläche mit Cache-Löschung hinzufügen?
uk_ua: Додати кнопку з очищенням кешу?

source: Тема оформления админки
de_de: Thema für den Adminbereich
uk_ua: Тема оформлення адмінки

source: Пока можно выбирать между светлой (стандартной) и тёмной. Сохраните и обновите страницу
de_de: Sie können vorerst zwischen hell (Standard) und dunkel wählen. Speichern und aktualisieren Sie die Seite
uk_ua: Поки що можна вибирати між світлим (стандартним) і темним. Збережіть і оновіть сторінку

source: Светлая
de_de: Hell (Light)
uk_ua: Світла

source: Тёмная
de_de: Dunkel (Dark)
uk_ua: Темна

source: Сохранить
de_de: Speichern
uk_ua: Зберегти

source: Проверить обновления
de_de: Nach Updates suchen
uk_ua: Перевірити оновлення

source: Идёт загрузка...
de_de: Es wird geladen...
uk_ua: Йде завантаження...

source: Загружается:
de_de: Es wird geladen:
uk_ua: Завантажується:

source: Загружено
de_de: Heruntergeladen
uk_ua: Завантажено

source: Проверка обновлений
de_de: Auf Update überprüfen
uk_ua: Перевірка оновлень

source: Загружаем файл: <b>${file}</b>!<br>Результат находится в консоли браузера!
de_de: Datei wird geladen: <b>${file}</b>!<br>Das Ergebnis befindet sich in der Browserkonsole!
uk_ua: Завантажуємо файл: <b>${file}</b>!<br>Результат знаходиться в консолі браузера!

source: Информация!
de_de: Informationen!
uk_ua: Інформація!

source: Обновлений нет
de_de: Keine Aktualisierung verfügbar
uk_ua: Оновлень немає

source: На сервере
de_de: Auf dem Server
uk_ua: На сервері

source: файлов
de_de: Dateien
uk_ua: {count, plural, one {файл} few {файли} many {файлів} other {файлів}}

source: Загружено на сайт
de_de: Auf die Website hochgeladen
uk_ua: Завантажено на сайт

source: Требуют установки
de_de: Erfordert die Installation
uk_ua: Потребують встановлення

source: Требуют обновления
de_de: Benötigt Updates
uk_ua: Потребують оновлення

source: Установить всё
de_de: Alles installieren
uk_ua: Встановити все

source: Установить недостающие
de_de: Fehlende installieren
uk_ua: Встановити відсутні

source: Установить обновления
de_de: Updates installieren
uk_ua: Встановити оновлення

source: <p>Данные были сохранены!</p><p>Страница сейчас обновится!</p>
de_de: <p>Die Daten wurden gespeichert!</p><p>Die Seite wird gleich aktualisiert!</p>
uk_ua: <p>Дані було збережено!</p><p>Сторінка зараз оновиться!</p>

source: Настройки модуля
de_de: Modul-Einstellungen
uk_ua: Налаштування модуля

source: [UPDATE] Минимальная версия PHP 8.3
de_de: [UPDATE] Mindestversion von PHP 8.3
uk_ua: [UPDATE] Мінімальна версія PHP 8.3

source: [UPDATE] Функционал обновлён до версий DLE 17.3
de_de: [UPDATE] Funktionalität auf DLE 17.3 Versionen aktualisiert
uk_ua: [UPDATE] Функціонал оновлений до версій DLE 17.3

source: [NEW] Добавлена поддержка Doctrine MhDB. Дальнейшие модели для базы данных будут работать через эту систему.
de_de: [NEW] Unterstützung für Doctrine MhDB wurde hinzugefügt. Weitere Modelle für die Datenbank werden über dieses System funktionieren.
uk_ua: [NEW] Додана підтримка Doctrine MhDB. Подальші моделі для бази даних будуть працювати через цю систему.

source: [UPDATE] Функционал обновлён до версий DLE 17.0
de_de: [UPDATE] Funktionalität auf DLE 17.0 Versionen aktualisiert
uk_ua: [UPDATE] Функціонал оновлений до версій DLE 17.0

source: [NEW] Добавлена мультиязычная поддержка, перевод можно осуществить при помощи сервиса Crowdin. Ссылка в подвале каждого модуля.
de_de: [NEU] Unterstützung für mehrere Sprachen hinzugefügt, die Übersetzung kann über den Crowdin-Dienst erfolgen. Link in der Fußzeile eines jeden Moduls.
uk_ua: [NEW] Додана мультимовна підтримка, переклад можна здійснити за допомогою сервісу Crowdin. Посилання у підвалі кожного модуля.

source: [NEW] Добавлена возможность выводов логов на отдельной странице.
de_de: [NEW] Es wurde die Möglichkeit hinzugefügt, Protokolle auf einer separaten Seite auszugeben.
uk_ua: [NEW] Додана можливість виводу логів на окремій сторінці.

source: [UPDATE] Установщик упрощён. Теперь зависимости загружаются и устанавливаются при первом открытии [любого] модуля. Может занять несколько минут. Теперь установщик весит мало.
de_de: [UPDATE] Das Installationsprogramm wurde vereinfacht. Die Abhängigkeiten werden jetzt beim ersten Öffnen eines Moduls geladen und installiert. Dies kann ein paar Minuten dauern. Das Installationsprogramm wiegt jetzt nur noch wenig.
uk_ua: [UPDATE] Встановник спрощений. Тепер залежності завантажуються та встановлюються при першому відкритті [будь-якого] модуля. Може зайняти кілька хвилин. Тепер встановник важить мало.

source: [UPDATE] Откат функций, которые использовали класс DLEFiles. Он не работает со сторонними разработками как надо. Либо работает, но документации к нему то нет.
de_de: [UPDATE] Rollback-Funktionen, die die Klasse DLEFiles verwendet haben. Es funktioniert nicht mit Entwicklungen von Drittanbietern, wie es sollte. Oder sie funktioniert, aber es gibt keine Dokumentation dafür.
uk_ua: [UPDATE] Скасування функцій, які використовували клас DLEFiles. Він не працює зі сторонніми розробками як слід. Або працює, але документації до нього немає.

source: [UPDATE] Функционал обновлён до версий PHP 8.1
de_de: [UPDATE] Die Funktionalität wurde auf PHP 8.1 aktualisiert.
uk_ua: [UPDATE] Функціонал оновлений до версій PHP 8.1

source: [UPDATE] Функционал обновлён до версий DLE 16.0
de_de: [UPDATE] Funktionalität auf DLE 16.0 Versionen aktualisiert
uk_ua: [UPDATE] Функціонал оновлений до версій DLE 16.0

source: [UPDATE] Решено было использовать стандартные классы DLE для работы с файлами
de_de: [UPDATE] Es wurde beschlossen, Standard-DLE-Klassen für die Arbeit mit Dateien zu verwenden
uk_ua: [UPDATE] Було вирішено використовувати стандартні класи DLE для роботи з файлами

source: [FIX] Исправлена ошибка: https://devcraft.club/tickets/http-error-500.6/
de_de: [FIX] Fehler behoben: https://devcraft.club/tickets/http-error-500.6/
uk_ua: [FIX] Виправлена помилка: https://devcraft.club/tickets/http-error-500.6/

source: [NEW] Добавлен функционал проверки обновления плагина
de_de: [NEW] Funktion zur Überprüfung von Plugin-Updates hinzugefügt
uk_ua: [NEW] Доданий функціонал перевірки оновлення плагіна

source: [UPDATE] Изменён подход к некоторым классам
de_de: [UPDATE] Geänderte Vorgehensweise bei einigen Klassen
uk_ua: [UPDATE] Змінено підхід до деяких класів

source: [FIX] Вернул поддержку PHP 7.2
de_de: [FIX] Zurückgegebene PHP 7.2-Unterstützung
uk_ua: [FIX] Відновлено підтримку PHP 7.2

source: [FIX] Вернул поддержку PHP >= 8
de_de: [FIX] Zurückgegebene PHP-Unterstützung >= 8
uk_ua: [FIX] Відновлено підтримку PHP >= 8

source: [FIX] Удалены остаточные файлы (кеш, конфигурации, ...)
de_de: [FIX] Restliche Dateien (Cache, Konfigurationen, ...) entfernt
uk_ua: [FIX] Видалені залишкові файли (кеш, конфігурації, ...)

source: [FIX] Вернул нужные, но удалённые файлы
de_de: [FIX] Benötigte, aber gelöschte Dateien wiederherstellen
uk_ua: [FIX] Відновлено потрібні, але видалені файли

source: [NEW] Добавлена функция отправки логов в телеграм [БЕТА]
de_de: [NEW] Funktion zum Senden von Protokollen an Telegram hinzugefügt [BETA]
uk_ua: [NEW] Додана функція відправки логів у телеграм [БЕТА]

source: [FIX] Исправил ошибку работы логирования
de_de: [FIX] Fehler in der Protokollierung behoben
uk_ua: [FIX] Виправлено помилку роботи логування

source: [FIX] Исправил работу моделей
de_de: [FIX] Modelle korrigiert
uk_ua: [FIX] Виправлено роботу моделей

source: [FIX] Исправил обработку кеша
de_de: [FIX] Cache-Behandlung korrigiert
uk_ua: [FIX] Виправлено обробку кешу

source: [FIX] Обновил файлы для генерации модуля
de_de: [FIX] Aktualisierte Dateien für die Modulgenerierung
uk_ua: [FIX] Оновлено файли для генерації модуля

source: [NEW] Добавлена возможность пользователю самому решать использовать ли в админпанели обновлённые иконки или нет
de_de: [NEW] Es wurde die Möglichkeit hinzugefügt, dass der Benutzer entscheiden kann, ob er die aktualisierten Icons im Admin-Panel verwenden möchte oder nicht.
uk_ua: [NEW] Додана можливість користувачу самостійно вирішувати використовувати оновлені іконки в адмінпанелі чи ні

source: [NEW] Добавлена возможность пользователю самому решать подключать в админке глобальную кнопку по очистке кеша или нет
de_de: [NEU] Es wurde die Möglichkeit hinzugefügt, dass der Benutzer entscheiden kann, ob er die Schaltfläche zum Löschen des globalen Caches im Admin-Bereich aktivieren möchte oder nicht.
uk_ua: [NEW] Додана можливість користувачу самостійно вирішувати підключати в адмінці глобальну кнопку для очищення кешу чи ні

source: [NEW] Дальнейшая работа с базой данных будет происходить только через созданные мною модели. Для этого будет использоваться функционал классов Model и Table
de_de: [NEW] Die weitere Arbeit mit der Datenbank wird nur über die von mir erstellten Modelle erfolgen. Zu diesem Zweck werden die Funktionen der Klassen Model und Table verwendet
uk_ua: [NEW] Подальша робота з базою даних буде здійснюватися лише через створені мною моделі. Для цього буде використовуватися функціонал класів Model та Table

source: [UPDATE] Логирование ошибок будет происходить в дальнейшем через <a href="https://seldaek.github.io/monolog/" target="_blank">Monolog - Logging for PHP</a>. При включённом функционале - библиотека будет отправлять уведомления в консоль браузера, а так-же сохранять файлов в папку логов
de_de: [UPDATE] Fehler in der Protokollierung werden weiterhin über <a href="https://seldaek.github.io/monolog/" target="_blank">Monolog - Logging for PHP</a>protokolliert. Wenn diese Funktion aktiviert ist, sendet die Bibliothek Benachrichtigungen an die Browserkonsole und speichert Dateien im Ordner logs.
uk_ua: [UPDATE] Логування помилок буде здійснюватися далі через <a href="https://seldaek.github.io/monolog/" target="_blank">Monolog - Logging for PHP</a>. При увімкненому функціоналі - бібліотека буде відправляти повідомлення в консоль браузера, а також зберігати файли в папку логів

source: [UPDATE] Обновление библиотек до последних версий с минимально возможной PHP версией <b>7.2.9</b>
de_de: [UPDATE] Aktualisieren Sie die Bibliotheken auf die neuesten Versionen mit der niedrigstmöglichen PHP-Version <b>7.2.9</b>
uk_ua: [UPDATE] Оновлення бібліотек до останніх версій з мінімально можливою версією PHP <b>7.2.9</b>

source: [UPDATE] Подключены иконки FontAwesome 6.1.1 Pro, используется вариант light (о не достающих или пропавших иконок прошу сообщать)
de_de: [UPDATE] FontAwesome 6.1.1 Pro Icons sind verbunden, es wird die Light-Variante verwendet (bitte melden Sie fehlende oder nicht vorhandene Icons).
uk_ua: [UPDATE] Підключено іконки FontAwesome 6.1.1 Pro, використовується варіант light (про відсутні або зниклі іконки прошу повідомляти)

source: [FIX] Путь до иконки модуля исправлен 🤦‍♂️
de_de: [FIX] Pfad zum Modulsymbol korrigiert 🤦‍♂️
uk_ua: [FIX] Шлях до іконки модуля виправлено 🤦‍♂️

source: [FIX] Продокументировал классы с небольшими объяснениями, что делает какая функция и для чего используется та или иная переменная
de_de: [FIX] Dokumentierte Klassen mit kleinen Erklärungen, was eine Funktion tut und wofür eine Variable verwendet wird.
uk_ua: [FIX] Продокументовано класи з невеликими поясненнями, що робить яка функція і для чого використовується та чи інша змінна

source: [DEL] Удалён кошелёк WMR
de_de: [DEL] Gelöschte WMR-Brieftasche
uk_ua: [DEL] Видалено гаманець WMR

source: FIX: Добавлена иконка
de_de: xdebug.mode
uk_ua: FIX: Додано іконку

source: FIX: Исправлен файл AJAX
de_de: openssl.cafile
uk_ua: FIX: Виправлено файл AJAX

source: В связи с некоторыми обстоятельствами пришлось отказаться от i18n модуля. Возможно он выйдет отдельным модулем.
de_de: openssl.capath
uk_ua: У зв'язку з деякими обставинами довелося відмовитися від модуля i18n. Можливо він вийде окремим модулем.

source: Обновление зависимостей до минимально требуемой версии PHP 7.4
de_de: apc.enabled
uk_ua: Оновлення залежностей до мінімально необхідної версії PHP 7.4

source: Улучшена реструктуризация классов
de_de: open_basedir
uk_ua: Поліпшено реструктуризацію класів

source: Добавлена тёмная тема оформления
de_de: foo
uk_ua: Додано темну тему оформлення

source: Для желающих создать модуль на основе моей админки была создана функция генерации путей и файлов
de_de: Bar
uk_ua: Для бажаючих створити модуль на основі моєї адмінки була створена функція генерації шляхів та файлів

source: Fontawesome были обновлены до 6ой версии
de_de: baz
uk_ua: Fontawesome було оновлено до 6-ї версії

source: Добавлена проверка на целостность файлов и их обновления
de_de: Befehl
uk_ua: Додано перевірку на цілісність файлів та їх оновлення

source: Полностью новая админпанель, которая не зависит от оформления и функционала самой DLE
de_de: Hilfe
uk_ua: Повністю нова адміністративна панель, яка не залежить від оформлення та функціоналу самої DLE

source: За основу панели был взят движок Twig, создавать свои шаблоны будет проще
de_de: <>%s<>info /info
uk_ua: Основою панелі був взятий движок Twig, створювати свої шаблони буде легше

source: Очищать кеш в админке стало проще - кнопка была выведена в ряд с "Добавить новость" и "Редактировать новости
de_de: Definition
uk_ua: Очищення кешу в адмінці стало простіше - кнопка була виведена в ряд із "Додати новину" та "Редагувати новини"

source: Внедрён i18n в систему DLE, это даёт возможность создавать мультиязычные сайты (модуль отдельно продаваться или делаться не будет)
de_de: Argumente
uk_ua: Впроваджено i18n в систему DLE, це дає можливість створювати мультимовні сайти (модуль окремо продаватися або робитися не буде)

source: i18n: не зависит от базы данных, все фразы хранятся в файлах json
de_de: Optionen
uk_ua: i18n: не залежить від бази даних, всі фрази зберігаються у файлах json

source: i18n: в шаблонах достаточно использовать тег {trans text="сюда переводимый текст"}, чтобы перевести фразу
de_de: Verwendungen
uk_ua: i18n: у шаблонах достатньо використовувати тег {trans text="сюди перекладений текст"}, щоб перекласти фразу

source: i18n: в скриптах PHP достаточно использовать функцию translate("сюда переводимый текст"), чтобы перевести фразу
de_de: Beschreibung
uk_ua: i18n: у скриптах PHP достатньо використовувати функцію translate("сюди перекладений текст"), щоб перекласти фразу

source: сюда переводимый текст
de_de: symfony
uk_ua: сюди перекладений текст

source: i18n: в скриптах JS достаточно использовать функцию translateJS("сюда переводимый текст"), чтобы перевести фразу. Желательно подгружать фразы при загруженной странице, т.к. async не доработан
de_de: Befehle
uk_ua: i18n: у скриптах JS достатньо використовувати функцію translateJS("сюди перекладений текст"), щоб перекласти фразу. Бажано завантажувати фрази при завантаженій сторінці, оскільки async не доопрацьований

source: i18n: мультиязычность поддерживается в "Новости", "Баннеры", "Категории", "Электронная почта / Рассылки", "Метатеги", "Опросы", "Вопросы и ответы", "Статические страницы", "Группы пользователей", а так-же вывод новостей и статических страниц на сайте
de_de: Namespaces
uk_ua: i18n: мультимовність підтримується в "Новини", "Банери", "Категорії", "Електронна пошта / Розсилки", "Метатеги", "Опитування", "Питання та відповіді", "Статичні сторінки", "Групи користувачів", а також вивід новин та статичних сторінок на сайті

source: i18n: поддерживается машинный перевод через сервис RapidApi
de_de: Namespace
uk_ua: i18n: підтримується машинний переклад через сервіс RapidApi

source: i18n: динамичное использование, не требующее массивов данных - достаточно указать текст
de_de: Argument
uk_ua: i18n: динамічне використання, не потребує масивів даних - достатньо вказати текст

source: небольшой фикс в языковом файле
de_de: Standardwerte
uk_ua: невелике виправлення в мовному файлі

source: Обновление иконок от fontawesome глобально
de_de: Standard
uk_ua: Оновлення іконок від FontAwesome глобально

source: Обновление многих функций
de_de: Option
uk_ua: Оновлення багатьох функцій

source: Добавление языковых файлов (в дальнейшем будет проще локализовать модули)
de_de: \n
uk_ua: Додавання мовних файлів (надалі буде простіше локалізувати модулі)

source: Добавлен немецкий язык к оболочке
de_de: \n\n
uk_ua: Додано німецьку мову до оболонки

source: Фикс
de_de: befehl_name
uk_ua: Виправлення

source: Новые модальные и всплывающие окна
de_de: Shell
uk_ua: Нові модальні та спливаючі вікна

source: Улучшены некоторые функции
de_de: Formatierer
uk_ua: Поліпшено деякі функції

source: Добавлен скрипт DateTimePicker
de_de: Erstausrüster
uk_ua: Додано скрипт DateTimePicker

source: Добавлены несколько украшательств
de_de: debug_formatter
uk_ua: Додано кілька прикрас

source: Вывод категорий
de_de: %s
uk_ua: Вивід категорій

source: Автоматический вывод доп. полей в админке
de_de: U
uk_ua: Автоматичний вивід додаткових полів в адмінці

source: Автоматический вывод пользователей
de_de: mbstring.func_overload
uk_ua: Автоматичний вивід користувачів

source: Исправлены баги в JS
de_de: FILTER_FLAG_EMAIL_UNICODE
uk_ua: Виправлено баги в JS

source: Обновление до актуальных версий DLE
de_de: speicher_limit
uk_ua: Оновлення до актуальних версій DLE

source: Мелкие правки
de_de: sperren
uk_ua: Мелкі виправлення

source: Основной релиз
de_de: Hauptversion
uk_ua: Основний реліз

source: История изменений
de_de: Geschichte der Änderungen
uk_ua: Історія змін

source: Новости
de_de: vendor-dir
uk_ua: Новини

source: Страницы DLE
de_de: bitbucket-oauth
uk_ua: Сторінки DLE

source: Главная
de_de: github-oauth
uk_ua: Головна

source: Модуль
de_de: gitlab-oauth

source: Доп. ссылки
de_de: gitlab-token
uk_ua: Додаткові посилання

source: На сайте автора
de_de: http-basic
uk_ua: На сайті автора
