<?php
//===============================================================
// Файл: MhLogRepository.php                                    =
// Путь: engine/inc/maharder/_repository/Admin/MhLogRepository.php
// Дата создания: 2024-04-15 07:45:01                           =
// ==============================================================
// Автор: Maxim Harder <dev@devcraft.club> © 2024               =
// Сайт: https://devcraft.club                                  =
// Телеграм: http://t.me/MaHarder                               =
// ==============================================================
// Менять на свой страх и риск!                                 =
// Код распространяется по лицензии MIT                         =
//===============================================================

class MhLogRepository extends BasisRepository {


}